# References:
# [1] Wang, C.-Y. et al.: Cspnet: A new backbone that can enhance learning capability of cnn. In: Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops (CVPRW), pp. 390--391, (2020)
# [2] Wang, C.-Y.: Official yolov7. https://github.com/WongKinYiu/yolov7/blob/main/cfg/baseline/yolov4-csp.yaml (2022)
# [3] Anonymous authors: Rcs-yolo: A fast and high-accuracy object detector for brain tumor detection. (2023)
# [4] Anonymous authors: Official rcs-yolo. https://anonymous.4open.science/r/RCS-YOLO-1F86 (2023)

# The proposed RCS-OSA modules are replaced by BottleneckCSPC from the CSP-Darknet backbone in yolov4-csp.yaml.
# To train or test by running train_repvgg-csp.py or ./test_repvgg-csp.py.

# Parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
  - [87,90,  127,139]  # P4/16
  - [154,171,  191,240]  # P5/32

# RCS-OSA backbone
backbone: # 12462
  # [from, number, module, args]
  [[-1, 1, RepVGG, [64, 3, 2]],  # 0-P1/2
   [-1, 1, RepVGG, [128, 3, 2]],  # 1-P2/4
   [-1, 2, BottleneckCSPC, [128]],
   [-1, 1, RepVGG, [256, 3, 2]],  # 3-P3/8
   [-1, 2, BottleneckCSPC, [256]],
   [-1, 1, RepVGG, [512, 3, 2]],  # 5-P4/16
   [-1, 4, BottleneckCSPC, [512, True]],
   [-1, 1, RepVGG, [1024, 3, 2]],  # 7-P5/32
   [-1, 2, BottleneckCSPC, [1024, True]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# RCS-OSA head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-1, 2, BottleneckCSPC, [512]],  # 12

   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 2, BottleneckCSPC, [512]],  # 14

   [-1, 1, RepVGG, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 2, BottleneckCSPC, [768]],  # 17

   [14, 1, RepVGG, [512, 3, 1]],
   [17, 1, RepVGG, [768, 3, 1]],

   [[18, 19], 1, IDetect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
